{"videos":[{"id":"IYEHl51VR1I","thumbnail":"http://img.youtube.com/vi/IYEHl51VR1I/0.jpg","title":"How to Create a Pancaked Heart Half-Up Hairstyle | Valentine's Day Hairstyles","description":"Learn how to create this beautiful Pancaked Heart Half-Up Hairstyle in under 3 minutes! With Valentine's Day quickly approaching, what hairstyles can you wear that are subtle yet festive to celebrate love? This is one!\n\nTo watch all of our other Valentine's Day Hairstyles, many featuring hearts, please CLICK here:  https://www.youtube.com/playlist?list=PL0FAB95890D9E83F8\n\nThere is another popular variation of this hairstyle out there, but this hair tutorial reverses the looping of the heart to allow for greater support of the heart after pancaking it. Pay particular attention to how I loop the hair through for the bows of the heart.\n\nTo see your own photo recreations of this style featured in our app, feel free to tag your photos on IG with: #CGHPancakeHeart\n\nBrooklyn volunteered to be my model today, and she looked absolutely stunning! Don't you agree???\n\nPlease be sure to give this video a BIG \"👍🏻\" if you loved it, and leave a comment below telling us which of all our Valentine's Day Hairstyles is your absolute favorite!\n\n💋's -Mindy\n\nItems Needed: Brush, rat-tail comb, spray bottle, 2 hair elastics, spray wax and/or hairspray {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Medium\n\n___\n\nWe post a new hairstyle tutorial or Behind the Braids family vlog every Sunday night.  Jordan and Katie post a guest post hairstyle every Thursday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://www.youtube.com/user/CuteGirlsHairstyles?sub_confirmation=1\n\nFacebook: http://www.facebook.com/CuteGirlsHairstyles\nTwitter: http://www.twitter.com/CuteGirlHair\nInstagram: http://www.Instagram.com/CuteGirlsHairstyles\nPinterest: http://www.pinterest.com/MrsHairdo\n\nAbout Cute Girls Hairstyles: \nMindy McKnight is a mother of six children and a teacher of all braids, past, present, and future! Enjoy hundreds of 5-minute hair tutorials that are cute and easy to recreate! Whether you're looking to learn how to create hairstyles such as waterfall braids, french braids, fishtail braids, lace braids, pancake braids, faux braids, plaits, twists, buns, ponytails, updos or something with a little edge... you can find it all here! (We even have Daddy Do's, hairstyles so easy that even a daddy can do them!) You'll also find a \"Behind the Braids\" family vlog, showing what goes on behind the scenes in our home, every other Sunday! Be sure to subscribe... and prepare for compliments!\n___\n\nFTC Disclaimer: This is not a sponsored video.\n__\n\n💥SUPERFANS💥: Please help us translate this video, and get credit below! http://www.youtube.com/timedtext_video?ref=share&v=IYEHl51VR1I\n\nAND you can help me translate MORE of my channel by clicking here! http://www.youtube.com/timedtext_cs_panel?tab=2&c=UC2LgZ_4GzSFQS-3a87_Jc6w","date":"2017-01-23T01:04:42.000Z"},{"id":"kkajA8dh91k","thumbnail":"http://img.youtube.com/vi/kkajA8dh91k/0.jpg","title":"Double Knotted Braids | Cute Girls Hairstyles","description":"Be sure to check back here on Wednesday night (7pm CST) for a special BONUS video that our family filmed for you! It's been something we've talked about doing for several years now, but just wasn't able to find the time until now!\n\nAlso, click here to win 1 of BrooklynAndBailey's Back-to-School Backpacks + Supplies + iPad Mini! (Two winners will be chosen!)\nhttp://www.cutegirlshairstyles.com/BBGiveBackpacks\n\nWe used to do this hairstyle on Brooklyn & Bailey all the time when they were younger. Not sure why we stopped doing it, but I recently saw a picture of it in my old hairstyle photo album, so there you go!\n\nWe sometimes call this the shoelace braid, since the concept of the braid is similar to the first step of tying a show. Only to make a braid, you simply add in hair to each side before tying your next knot.\n\nIt's pretty easy once you get the hang of it. You can do this on any braid, or in a hairstyle combo.\n\nTo see your own photo recreations of this style featured in our app, feel free to tag your photos on IG with: #CGHDblKnotBraids\n\nPlease be sure to give this video a BIG \"👍🏻\" if you loved it, and leave a comment below telling us what you think our special video will be on Wednesday!\n\n💋's -Mindy\n\nItems Needed: Brush, rat-tail comb, spray bottle, 2 small hair elastics, hairspray or spray wax {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Medium\n\n___\n\nWe post a new hairstyle tutorial or Behind the Braids family vlog every Sunday night.  Abby and Annie post a guest post hairstyle every Thursday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://www.youtube.com/user/CuteGirlsHairstyles?sub_confirmation=1\n\nFacebook: http://www.facebook.com/CuteGirlsHairstyles\nTwitter: http://www.twitter.com/CuteGirlHair\nInstagram: http://www.Instagram.com/CuteGirlsHairstyles\nPinterest: http://www.pinterest.com/MrsHairdo\n\nAbout Cute Girls Hairstyles: \nMindy McKnight is a mother of six children and a teacher of all braids, past, present, and future! Enjoy hundreds of 5-minute hairstyles that are cute and easy to recreate! Whether you're looking to learn how to create waterfall braids, french braids, fishtail braids, lace braids, pancake braids, faux braids, plaits, twists, buns, ponytails, updos or something with a little edge... you can find it all here! (We even have Daddy Do's, hairstyles so easy that even a daddy can do them!)  Be sure to subscribe... and prepare for compliments!\n___\n\nFTC Disclaimer: This is not a sponsored video.","date":"2016-09-05T00:09:38.000Z"},{"id":"0epGhecdPpU","thumbnail":"http://img.youtube.com/vi/0epGhecdPpU/0.jpg","title":"Double Knot Pullback from Legally Blonde | Cute Girls Hairstyles","description":"Love Kamri? Subscribe to her KamriNoel channel HERE!\nhttp://www.youtube.com/user/kamrinoel?sub_confirmation=1\n\nMy mom and sisters LOVE the movie Legally Blonde, with Reese Witherspoon. The scene we love the most is when Elle is teaching Paulette how to do the \"Bend and Snap\" pose to catch a guy's attention!\n\nIn that scene, Elle wears a super cute hairstyle using a single knot pullback. It is so super easy to do, that I wanted to teach y'all how to do it! This hairstyle literally takes no more than 2 minutes to create!\n\nTo see your own photo recreations of this style featured in our app, feel free to tag your photos on IG with: #CGHDblKnotPullback\n\nPlease be sure to give this video a BIG \"👍🏻\" if you loved it, and leave a comment below telling us if you you would like to see more tutorials from Bailey!\n\n💋's -Bailey\n\nItems Needed: Brush, rat-tail comb, spray bottle, 4 small bobby pins, hairspray {if desired}.\n\nTime Requirement: 2 minutes\n\nSkill Level: Easy\n\n___\n\nWe post a new hairstyle tutorial or Behind the Braids family vlog every Sunday night.  Abby and Annie post a guest post hairstyle every Thursday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://www.youtube.com/user/CuteGirlsHairstyles?sub_confirmation=1\n\nFacebook: http://www.facebook.com/CuteGirlsHairstyles\nTwitter: http://www.twitter.com/CuteGirlHair\nInstagram: http://www.Instagram.com/CuteGirlsHairstyles\nPinterest: http://www.pinterest.com/MrsHairdo\n\nAbout Cute Girls Hairstyles: \nMindy McKnight is a mother of six children and a teacher of all braids, past, present, and future! Enjoy hundreds of 5-minute hairstyles that are cute and easy to recreate! Whether you're looking to learn how to create waterfall braids, french braids, fishtail braids, lace braids, pancake braids, faux braids, plaits, twists, buns, ponytails, updos or something with a little edge... you can find it all here! (We even have Daddy Do's, hairstyles so easy that even a daddy can do them!)  Be sure to subscribe... and prepare for compliments!\n___\n\nFTC Disclaimer: This is not a sponsored video.","date":"2016-06-27T00:03:02.000Z"},{"id":"pWpS-xSv0Us","thumbnail":"http://img.youtube.com/vi/pWpS-xSv0Us/0.jpg","title":"2-in-1 Angel Wing Combo + EXCITING NEWS!!!","description":"Check out Brooklyn & Bailey's most recent video, a \"Twin vs Twin\" challenge! It'll have you laughing! Click HERE... http://youtu.be/OGCjA1mxssg\n\nIt's time for another 2-in1 combo hairstyle, and it is simply beautiful! This was originally only a half-up style and is inspired by Cynthia Truong. You can see Cynthia's tutorial here: http://youtu.be/iRzo7iWtews\n\nWe've been doing tiebacks and half-up styles on CHG here for years, and there are many favorites that my girls just LOVE! This one is no exception!\n\nThe pattern created by style's stranding looks very much like angel wings, don't you think? We added a loose fishtail braid and micro-crimps add texture and complete the combo.\n\nTo see your photo recreations of this style featured in our app, feel free to tag your own photos on IG with: #CGHAngelWingCombo\n\nPlease be sure to give this video a BIG \"👍🏻\" if you loved it, and leave a comment below telling us whether you are excited for more hairstyle tutorials from some of my braiding friends, or to see our \"Behind the Braids\" vlogs!\n\n💋's -Mindy\n\nItems Needed: Texturing iron, brush, rat-tail comb, spray bottle, 2 small hair elastics, hairspray {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Medium\n\n\n___\n\nWe post a new hairstyle tutorial every Sunday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://www.youtube.com/user/CuteGirlsHairstyles?sub_confirmation=1\n\nFacebook: http://www.facebook.com/CuteGirlsHairstyles\nTwitter: http://www.twitter.com/CuteGirlHair\nInstagram: http://www.Instagram.com/CuteGirlsHairstyles\nPinterest: http://www.pinterest.com/MrsHairdo\n\n\n___\n\nFTC Disclaimer: This is not a sponsored video.","date":"2016-03-28T00:17:28.000Z"},{"id":"dRvNHIe4BwM","thumbnail":"http://img.youtube.com/vi/dRvNHIe4BwM/0.jpg","title":"Simple Knotted Updo | Easy Hairstyles","description":"Click here to subscribe to our new channel, MillennialMoms!\nhttp://youtube.com/c/MillennialMoms?sub_confirmation=1\n_\n\nFor this week's tutorial, we show you how to create a Simple Knotted Updo hairstyle! This look is perfect for girls of any age, and on medium to long hair. It is also a style that can be done in just a few minutes, for those mornings when you are running late but still want to look cute!\n\nTo see your own photo recreations of this style featured in our app, feel free to tag your photos on IG with: #CGHKnottedUpdo\n\nPlease be sure to give this video a BIG \"👍🏻\" if you loved it, and leave a comment below telling us if you've checked out our new mom channel {link above}!\n\n💋's -Mindy\n\nItems Needed: Brush, rat-tail comb, spray bottle, 6-10 bobby pins, hairspray {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Easy\n\n___\n\nWe post a new hairstyle tutorial every Sunday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://www.youtube.com/user/CuteGirlsHairstyles?sub_confirmation=1\n\nFacebook: http://www.facebook.com/CuteGirlsHairstyles\nTwitter: http://www.twitter.com/CuteGirlHair\nInstagram: http://www.Instagram.com/CuteGirlsHairstyles\nPinterest: http://www.pinterest.com/MrsHairdo\n\n___\n\nFTC Disclaimer: This is not a sponsored video.","date":"2015-12-21T01:42:13.000Z"},{"id":"_aVZKUQuvGI","thumbnail":"http://img.youtube.com/vi/_aVZKUQuvGI/0.jpg","title":"DIY Triple Knot Accents | Hairstyles for Short Hair","description":"If you are looking for long hairstyles, medium hairstyles, or short hairstyles, these Triple Knot Accents are a perfect style for you! Use them in updo's, in combination with braids, buns, ponytails, twists, etc! \n\nI used flat iron curls as a base for this hairstyle, which turned out just like I wanted! A-MAZ-ING!  Back when we first started this channel, our mom created a tutorial for flat iron curls! Click here to watch it: http://youtu.be/u_xJAHKzeUw\n\nTo see your own photo recreations of this style featured in our CGH app, feel free to tag your photos on IG with: #CGH3KnotAccents\n\nThe knot accents are so easy to do, all that y'all really need to know is how to tie a simple knot and pin it back with a bobby pin! So easy anyone can do it! Easy peasy, right?\n\nThis is perfect if you are looking for quick hairstyles to get ready for school in the mornings. It really does only take 2 minutes to do!\n\n💋's -Bailey\n\nItems Needed: Brush, rat-tail comb, spray bottle, 3 small bobby pins, hairspray {if desired}.\n\nTime Requirement: 2 minutes\n\nSkill Level: Easy\n\nTo see step-by-step instructions and more photos of this style, please visit... http://www.cutegirlshairstyles.com\n_____________\n\nWe post a new hairstyle tutorial every Sunday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n__________\n\nMusic: Fun Is On My Side\nby RimskyMusic\nLink: http://www.premiumbeat.com/royalty_free_music/songs/fun-is-on-my-side\nLicense #524334: Purchased non-exclusive Standard commercial use","date":"2015-01-19T01:04:00.000Z"},{"id":"qGIJBd38La4","thumbnail":"http://img.youtube.com/vi/qGIJBd38La4/0.jpg","title":"How to Create a Knotted Ponytail | Cute Hairstyles","description":"Don't forget to download the CGH App here:  http://www.cutegirlshairstyles.com/CGH-app\n\n* ~ * ~ * ~ * ~ * ~ *\n\nOur Knotted Headband hairstyle two years ago was such a hit, we decided to give you a similar look but in a ponytail.\n\nInspiration for this technique came from another hair blogger named Princess Piggies years ago, but we've never had time to show you how to do this until now.\n\nIf you can make the first stitch of tying your shoe, you can do this easily!\n\nKamri volunteered to be my model, and I always have fun filming with her... can you tell???\n\nFeel free to tag your own photos of this hairstyle with: #CGHKnottedPonytail\n\nEnjoy the tutorial, and prepare for compliments!\n\nxoxo\n-Mindy\n\nItems Needed: Brush, rat-tail comb, spray bottle, 1 ponytail holder, 1 hair elatic, 2 small claw hair clips, spray wax and hairspray {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Easy\n\nTo see step-by-step instructions and more photos of this style, please visit... http://www.cutegirlshairstyles.com\n\n* ~ * ~ * ~ * ~ *\n\nWe post a new hairstyle tutorial every Sunday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFeel free to follow us on BlogLovin, where many YT Gurus have beauty blogs...\nhttp://www.bloglovin.com/blog/1815559\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n\n* ~ * ~ * ~ * ~ *\nMusic: Picture Perfect (acoustic)\nby Charity Vance (http://www.youtube.com/CharityVanceMusic)\niTunes Link:  https://itunes.apple.com/us/album/love-me-ep/id818294153?uo=4&at=1l3v7Rs\nLicense: Personal emailed permission from Charity herself.","date":"2014-05-19T00:08:23.000Z"},{"id":"L4kLN6j2Edc","thumbnail":"http://img.youtube.com/vi/L4kLN6j2Edc/0.jpg","title":"How to Create a Knotted Braid Tieback | Cute Hairstyles","description":"We have been showing how to use knots in our hairstyles going back nearly 5 years now, but this is the first time we have used them in a tieback.\n\nIf you can make the first stitch of tying your shoe, you can create this braid!\n\nWhat I love about this braid tieback, is the unique \"crown\" look that it gives for a half-up half-down hairstyle. By adding a cute bow, you have a braided hairstyle that will bring many compliments your way!\n\nTag your own photos of this hairstyle with: #CGHKnotBraidTieback\n\nBrooklyn volunteered to be my model today, and of course, I go off my normal dress trend to wear a Marvel Avengers t-shirt! Brooklyn said it made me look hip!\n\nxoxo\n-Mindy\n\nItems Needed: Brush, rat-tail comb, spray bottle, 1 small hair elastic, 1 bobby pin, hairspray and accessory {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Medium\n\nTo see step-by-step instructions and more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\n* ~ * ~ * ~ * ~ *\n\nWe post a new hairstyle tutorial every Sunday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFeel free to follow us on BlogLovin, where many YT Gurus have beauty blogs...\nhttp://www.bloglovin.com/blog/1815559\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n\n* ~ * ~ * ~ * ~ *\nMusic: It's Alright (acoustic)\nby Charity Vance (http://www.youtube.com/CharityVanceMusic)\niTunes Link:  https://itunes.apple.com/us/album/love-me-ep/id818294153?uo=4&at=1l3v7Rs\nLicense: Personal emailed permission from Charity herself.","date":"2014-04-07T00:03:15.000Z"},{"id":"FlII8bOW_Ow","thumbnail":"http://img.youtube.com/vi/FlII8bOW_Ow/0.jpg","title":"3 Ways to Wear a Celtic Knot | St. Patrick's Day Hairstyles","description":"Learn how to recreate Elsa's Coronation Updo from Disney's \"Frozen\", here: http://youtu.be/Vl-8jueZ7NE\n\nWith St. Patrick's Day just around the corner, we wanted to upload a tutorial to celebrate our family's Irish/Scottish heritage {from both sides of the family}... a hairstyle I have wanted to do for a long time. The Celtic Knot.\n\nTag your own photos of this hairstyle with: #CGHCelticKnots\n\nThe Celtic Knot has been around for centuries, traditionally used to adorn religious sculptures and various kinds of artwork. You can find several versions of this knot in hairstyle form on Pinterest, as well as a few YouTube tutorials.\n\nToday, Brooklyn and I wanted to create variations of this knot using curls as the base.  Brooklyn just used her NuMe curling wand to achieve the curls.  \n\nHere we show you three versions, a Single Celtic Knot, a Double Celtic Knot, and a Side Celtic Knot.  Believe it or not, but the side version is my favorite!\n\nNow, because this is a winding knot, using only two strands, it can be very confusing to learn how to tie.  This is why I showed you how to tie the knot \"three\" times in the video, hoping that the repetition will help.\n\nI also show you a helpful tip which is useful in helping the knot to keep its shape, and to also help the falling strands lay flat.\n\nEnjoy!\n\nxoxo\n-Mindy\n\nItems Needed: Brush, rat-tail comb, spray bottle, pomade, and hairspray {if desired}.\n\nTime Requirement: 2-3 minutes\n\nSkill Level: Medium\n\nTo see step-by-step instructions and more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\n* ~ * ~ * ~ * ~ *\n\nDon't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFeel free to follow us on BlogLovin, where many YT Gurus have beauty blogs...\nhttp://www.bloglovin.com/blog/1815559\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n\n* ~ * ~ * ~ * ~ *\nMusic: It's Alright (acoustic)\nby Charity Vance (http://www.youtube.com/CharityVanceMusic)\niTunes Link:  https://itunes.apple.com/us/album/love-me-ep/id818294153?uo=4&at=1l3v7Rs\nLicense: Personal emailed permission from Charity herself.","date":"2014-03-10T00:33:05.000Z"},{"id":"N1I3UVVkYdw","thumbnail":"http://img.youtube.com/vi/N1I3UVVkYdw/0.jpg","title":"The Knotted Pullback | Cute Girls Hairstyles","description":"We wanted to show you another 3-minute hairstyle that is different enough from a simple pullback that your friends will wonder how you did it!\n\nFeel free to tag your own photos of this hairstyle with: #CGHKnottedPullback\n\nThe style uses a simple knotting technique that is easy to put in and easy to take out.  Enjoy!\n\nItems Needed: Brush, rat-tail comb, spray bottle, 2 bobby pins, hairspray and accessory {if desired}.\n\nTime Requirement: 3 minutes\n\nSkill Level:  Easy\n\nTo see step-by-step instructions and more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\n* ~ * ~ * ~ * ~ *\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\nDon't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFeel free to follow us on BlogLovin, where many YT Gurus have beauty blogs...\nhttp://www.bloglovin.com/blog/1815559\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n\n* ~ * ~ * ~ * ~ *\nMusic:\nYellow Carousel\nby Olive Musique\nSource Link:  http://tinyurl.com/YellowCarousel\nhttp://www.premiumbeat.com/license (Standard)","date":"2013-01-21T01:00:12.000Z"},{"id":"i1iD759oruA","thumbnail":"http://img.youtube.com/vi/i1iD759oruA/0.jpg","title":"Bantu Knot Curls | Easy No-Heat Curls | Cute Girls Hairstyles","description":"To see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nFans absolutely love our No-Heat Curl series, and this is Bantu Knot version is one we in our home have been enjoying for many years now!  {This knot technique is of African origin and has been by African women and girls for generations.}\n\nFeel free to tag your own photos of this hairstyle with: #CGHBantuKnotCurls\n\nBantu knots are fabulous to use in combo hairstyles!  In fact, you can see other styles in which we have used the Bantu Knots here...\n\nStar Twists:   http://youtu.be/NrN2LKuFc-A \nThe Bun Hawk:   http://youtu.be/qfWHYOjpCR4  \n\nEach of these Bantu Knot styles leaves gorgeous curls for the next day when you untwist the knots!  The curls can last you up to 3-4 days!  I find that you really do not have to keep them in all night to achieve great curls... as you get better creating the knots, you can leave them in for only 3-4 hours and receive a great result.  \n\n{Most Common Overlooked Mistake:  Be sure that you only dampen the hair before twisting the knots... if the hair is too wet, the hair will fall limp when you take our the knots!}\n\nItems Needed:  Brush, Rat-tail comb, 10 hair elastics, hairspray and accessory {if desired}.\n\nTime Requirement:  5-7 minutes to create knots, sleep overnight, 5-7 minutes to remove twists and style hair.\n\n\n\n* ~ * ~ * ~ * ~ *\nMusic:\nYellow Carousel\nby Olive Musique\nSource Link:  http://tinyurl.com/YellowCarousel\nhttp://www.premiumbeat.com/license  (Standard)","date":"2012-11-12T01:37:30.000Z"},{"id":"6uPj2JueWaw","thumbnail":"http://img.youtube.com/vi/6uPj2JueWaw/0.jpg","title":"Cocoon Curls | Easy No-Heat Curls | Cute Girls Hairstyles","description":"Be sure to check out Intermountain Moms on Facebook:  https://www.facebook.com/intermountainmoms/app_197602066931325\n\nNurse Dani at IntermountainMoms was able to help me this last week know when we should take CGH#1 to the doctor after she fractured her wrist during gymnastics... she saved me approx $150 for an x-ray that would have been too early to tell! {It is fractured, BTW. *sad*} They are also giving away a ton of stuff every day, so I, of course, entered the giveaway!\n\nFeel free to tag your own photos of this hairstyle with: #CGHCocoonCurls\n\nThis week's hairstyle is sure to be a popular one, since so many women, moms, and teen girls are reluctant to use too much heat in their hair.  The challenge with no heat, is how do you obtain gorgeous curls without heat?\n\nWell, we have already shown you how to create No-Heat Headband Curls:\nhttp://youtu.be/0Rdfgu3zqY4\n\nAnd we have shown you how to create No-Heat Sock Curls:\nhttp://youtu.be/CzJKdHglFck\n\n...but here we show you a very interesting, yet easy way to get voluminous curls without heat!  It uses a technique we call \"Cocooning,\" yes, cocooning as in a caterpillar turning into a butterfly!  {We originally learned this curl from http://www.youtube.com/beautyklove, so be sure to check her out.}\n\nThis technique only provides the curl on the bottom half of the hair, so I find that a headband or hat is the perfect accessory for this hairstyle!  The curls also last for a few days, so you can combine these curls as a 2nd or 3rd day 'do using any of our accent braids, twists, etc!\n\nEnjoy!\n\nItems Needed: Brush, rat-tail comb, spray bottle, bandana, hairspray {if desired}.\n\nTime Requirement: 15-20 minutes\n\nTo see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\nMusic:\nYellow Carousel\nby Olive Musique\nSource Link:  http://tinyurl.com/YellowCarousel\nhttp://www.premiumbeat.com/license  (Standard)\nFTC Disclaimer:  This is a sponsored post","date":"2012-10-15T00:08:01.000Z"},{"id":"sU74rwC_hvI","thumbnail":"http://img.youtube.com/vi/sU74rwC_hvI/0.jpg","title":"Pullbacks into Square Knot | Daddy 'Do Hairstyles | Cute Girls Hairstyles","description":"What does dad do when mom is away? He does the girls hair!!!  See my hubby create this super cute Daddy 'Do!\n\nTo see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nWell, I am out of town all this week and the video we had planned to upload tonight had sound issues in some parts.  So... my husband called to tell me that bad news and asked me what I thought he should do!  Guess what I said???  Yep... \"Film a Daddy 'Do!\"\n\nThis hairstyle is not one we recommend if you are going to be active all day, but for more formal occasions or days when you are just simply going out, walking around, or at church, it is a simple yet very beautiful hairstyle! \n\nFeel free to tag your own photos of this hairstyle with: #CGHSquareKnotPullback\n\nCheck out my hubby's other Daddy 'Do hairstyles here...\nTriple-Flipped Ponytail {hhttp://youtu.be/zBJAHfrix2I}\nFour Twist Ponytail {http://youtu.be/mKSAp9V3hcM}\nSimple Braid {http://youtu.be/_GwFGqN3PNE}\n\nThe \"Twistbacks into Square Knot\" tutorial is my husband's creation, and I actually think he did a very good job on it... what do you think?  {I am, however, going to have to talk to him about what he's been feeding our kids!}\nEnjoy!\n\nItems Needed: Brush, rat-tail comb, spray bottle, pomade, 1 large hair elastic, 2-3 small bobby pins, hairspray {if desired}.\n\nTime Requirement: 3-5 minutes\n\n* ~ * ~ * ~ * ~ *\nMusic:\nYellow Carousel\nby Olive Musique\nSource Link:  http://tinyurl.com/YellowCarousel\nhttp://www.premiumbeat.com/license  (Standard)","date":"2012-09-23T23:31:27.000Z"},{"id":"8UHgEgyzd9U","thumbnail":"http://img.youtube.com/vi/8UHgEgyzd9U/0.jpg","title":"The Knotted Headband | Bangs or Fringe | Cute Girls Hairstyles","description":"To see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nWhat I love most about our fans is that they often email links to hairstyles that I have not seen before.  This knotted headband style was sent in by a fan from St. Petersburg, Russia and we loved it!\n\nIf you know how to do the first step of tying your shoe, you can do this braid!  It is created with essentially overlapping square knots.  I start with the hair wet, and use a little pomade... when the hair dries, the loops of the knots spread a little and look gorgeous!  \n\nFeel free to tag your own photos of this hairstyle with: #CGHKnottedHeadband\n\nThis braid is perfect for dancers, cheerleaders, or just wearing around town or with a combo for a dance or formal occasion!  It is also great for women of all ages!  We have worn this on my #4 daughter with short hair, and is a braid you can do on yourself as well!  I guarantee you will certainly receive lots of compliments on this hairstyle!\n\nEnjoy!\n\nItems Needed: Brush, rat-tail comb, spray bottle, pomade, 1 small hair elastic, 1-2 bobby pins, hairspray {if desired}.\n\nTime Requirement: 5-10 minutes\n\n\n* ~ * ~ * ~ * ~ *\nMusic:\nYellow Carousel\nby Olive Musique\nSource Link:  http://tinyurl.com/YellowCarousel\nhttp://www.premiumbeat.com/license  (Standard)","date":"2012-08-06T04:16:41.000Z"},{"id":"pYGrnOiqSDI","thumbnail":"http://img.youtube.com/vi/pYGrnOiqSDI/0.jpg","title":"French Knotted Braid | Cute Girls Hairstyles","description":"To see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nA viewer from Moldova sent me a photo of this hairstyle that I thought was very unique.  She asked if I could replicate it, and it took me several hours to do so.  It is very much like a Dutch Braid, only you are knotting rather than braiding.  \n\nFeel free to tag your own photos of this hairstyle with: #CGHFrenchKnottedBraid\n\nHope you enjoy the tutorial!","date":"2010-11-17T15:07:35.000Z"},{"id":"R96MI6ayH1c","thumbnail":"http://img.youtube.com/vi/R96MI6ayH1c/0.jpg","title":"Double Knots into Side Ponytail | Cute Girls Hairstyles","description":"To see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nThis is a fun teen hairstyle that can be finished off in various ways.  After completing the two simple knots on top, as you finish of the side ponytail... you can do it as a bun, braid (regular or fishtail), many braids, curls, or regular ponytail (as I did here).  By changing this up, this one style can give you about 5 or so hairdos!\n\nFeel free to tag your own photos of this hairstyle with: #CGH2KnotSidePony\n\nEnjoy!","date":"2010-10-25T18:29:01.000Z"},{"id":"91YLg7xYNLc","thumbnail":"http://img.youtube.com/vi/91YLg7xYNLc/0.jpg","title":"Top-Knot into Banded Pony | Cute Girls Hairstyles","description":"To see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nAgain, this is a very simple but very cute hairstyle.  To see step-by-step photos and instructions of this hairdo, please visit http://www.cutegirlshairstyles.com/ponytails/cute-top-knot-with-banded-ponytail/  \n\nFeel free to tag your own photos of this hairstyle with: #CGHTopKnotBandedPony\n\nEnjoy!","date":"2010-05-18T14:48:38.000Z"}]}