{"videos":[{"id":"VFGxAa0gLIo","thumbnail":"http://img.youtube.com/vi/VFGxAa0gLIo/0.jpg","title":"Rick Rack Braid | Cute Girls Hairstyles","description":"Click HERE to watch BrooklynAndBailey's \"Parent Trap Parody\" & \"Prom Dress Gone Wrong\" comedy collab with StudioC! http://youtu.be/unFAHooh_zE?list=UU6QWhGQqf0YDYdRb0n6ojWw\n\nThis braided hairstyle is inspired by the rick rack ribbon used in both the sewing and quilting worlds. {We've shown you this technique a long time ago, in our Textured Braids tutorial back in 2013... http://youtu.be/EVX_7Qq_y6s}\n\nRick Rack is literally defined by Webster's Dictionary as \"a flat braid to form zigzags and used especially as trimming on clothing.\" \n\nOur tutorial today uses the Rick Rack braid as a simple pinback with Kamri's straight hair. Although the braid looks fairly complex, it really is one of the easiest to create. If you know how to braid a simple 3-strand braid, then this one is going to be easy for you!\n\nTo see your own photo recreations of this hairstyle featured in our app, feel free to tag your photos on IG with: #CGHRickRackBraid\n\nWe use this braid as an accent, simply because it has so much already going on with it. This braid could also be cute as a tieback. \n\nPlease be sure to give this video a BIG \"👍\" if you loved it, and leave a comment below telling us if you've watched the twins' Parent Trap parody video {link at the top of description box}!\n\n💋's -Mindy\n \n\nItems Needed: Brush, rat-tail comb, spray bottle, 1 small hair elastic, 2 small bobby pins, hairspray {if desired}.\n\nTime Requirement: 3-5 minutes\n\nSkill Level: Easy\n\nClothing Links: All links to clothing worn in this video are on our website here... http://www.cutegirlshairstyles.com/?p=9129\n\n_____\n\nWe post a new hairstyle tutorial every Sunday night {7pm CST}! \n\nSo, please don't forget to subscribe to our YouTube channel...\nhttp://www.youtube.com/user/CuteGirlsHairstyles?sub_confirmation=1\n\nFollow CGH on Facebook: @CuteGirlsHairstyles\nFollow CGH on Twitter: @CuteGirlHair\nFollow CGH on Pinterest: @MrsHairdo\nFollow CGH on Instagram: @CuteGirlsHairstyles\n___\n\nFTC Disclaimer: This is not a sponsored video.\n___\n\nMusic: Only You\nby Katie Sky (http://katiesky.com)\niTunes Link USA: http://labrecs.com/OnlyUS\niTunes Link UK: http://labrecs.com/Only\nLicense: Personal emailed permission from Katie herself.","date":"2015-06-15T00:05:26.000Z"},{"id":"aji4YSjkTWo","thumbnail":"http://img.youtube.com/vi/aji4YSjkTWo/0.jpg","title":"Ribbon Accent Loony Braid | Cute Braid Ideas","description":"Also be sure to tag #CGHRibbonLoonyBraid on your recreations of this hairstyle on Instagram and Twitter!  We will be searching your photos all week and posting some of them on our CuteGirlsHairstyles Instagram page {http://www.instagram.com/CuteGirlsHairstyles}\n\n* ~ * ~ * ~ * ~ * ~ * ~ *\n\nMy voice has not yet recovered from being sick, so Bailey offered to film one of her hairstyles today... which I felt was very thoughtful.\n\nMany of you have seen our Loony Braid tutorials, and this is a variation of it using ribbon.  It creates such a unique and beautifully-accented braid, and can be done in about 2 minutes!  All you need to know is how to create a simple 3-strand braid.  If you can do that, this hairstyle is a cinch!\n\nEnjoy!\n\nItems Needed: Brush, rat-tail comb, spray bottle, 1 hair band, 2 yards {2 meters} of your favorite color hair ribbon, hairspray or pomade {if desired}.\n\nTime Requirement: 2-3 minutes\n\nSkill Level: Easy\n\nTo see step-by-step instructions and more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\n* ~ * ~ * ~ * ~ *\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://bit.ly/VHKvKf\n\nDon't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFeel free to follow us on BlogLovin, where many YT Gurus have beauty blogs...\nhttp://www.bloglovin.com/blog/1815559\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n\n* ~ * ~ * ~ * ~ *\nMusic: Icing\nby Charity Vance (http://www.youtube.com/CharityVanceMusic)\niTunes Link:  http://tinyurl.com/CharityVanceIcing\nLicense: Personal emailed permission from Charity herself.","date":"2013-09-09T00:04:10.000Z"},{"id":"EVX_7Qq_y6s","thumbnail":"http://img.youtube.com/vi/EVX_7Qq_y6s/0.jpg","title":"Textured Braids | Half-Up Half-Down Hairstyles","description":"BE SURE TO WATCH ALL THE WAY TO THE END!  To see step-by-step instructions and more photos of this style, please visit... http://www.cutegirlshairstyles.com\n\nTag your own photos of this hairstyle with: #CGHTexturedBraids\n\nToday's hairstyle is a half-up, half down style that is very different than others you might have seen, and fairly easy to do.  CGH#3's hair showcases the braids very well!\n\nThese braids are very similar to our Loony Braids {http://youtu.be/Gk1qjTzh8H4}, but instead of braiding with one large strand and two smaller strands... these \"textured\" braids are made with one small strand and two large strands.\n\nThe pullback I did here is optional, and you will need to bobby pin it to be sure it covers the third braid.  You can also use these braids as accents in any hairstyle. \n\nHope you enjoy!\n\nItems Needed: Brush, rat-tail comb, spray bottle, 3 small hair elastics, 1-2 bobby pins and hairspray {if desired}.\n\nTime Requirement: 5 minutes\n\nSkill Level: Medium\n\n* ~ * ~ * ~ * ~ *\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://bit.ly/VHKvKf\n\nDon't forget to subscribe to our YouTube channel...\nhttp://bit.ly/VovoC9\n\nFeel free to follow us on BlogLovin, where many YT Gurus have beauty blogs...\nhttp://www.bloglovin.com/blog/1815559\n\nFollow CGH on Facebook:\nhttp://www.facebook.com/CuteGirlsHairstyles\n\nFollow CGH on Twitter:\nhttp://www.twitter.com/CuteGirlHair\n\nFollow CGH on Pinterest, and see my \"Try\" board...\nhttp://www.pinterest.com/MrsHairdo\n\nFollow CGH on Instagram and see unpublished photos of our family:\nhttp://www.instagram.com/CuteGirlsHairstyles\n\n\n* ~ * ~ * ~ * ~ *\nMusic: Icing\nby Charity Vance (http://www.charityvance.net)\niTunes Link:  http://tinyurl.com/CharityVanceIcing\nLicense: Personal emailed permission from Charity herself.","date":"2013-05-27T00:41:33.000Z"},{"id":"Gk1qjTzh8H4","thumbnail":"http://img.youtube.com/vi/Gk1qjTzh8H4/0.jpg","title":"Loony Braids | Crazy Hair Day | Cute Girls Hairstyles","description":"To see more photos of this style, please visit...\nhttp://www.cutegirlshairstyles.com\n\nWant to become a \"Super Fan\" of the week, and potentially have your photo appear in a future video?  Simply email us a photo of you doing something crazy or fun while wearing a CGH t-shirt!  Grab our gear here...\n\nhttp://www.cutegirlshairstyles.bigcartel.com\n\n...and follow us at our other social hangouts!\nhttp://www.bloglovin.com/blog/1815559\nhttp://www.facebook.com/CuteGirlsHairstyles\nhttp://www.twitter.com/CuteGirlHair\nhttp://www.pinterest.com/MrsHairdo\nhttp://www.instagram/CuteGirlsHairstyles\n\n* ~ * ~ * ~ * ~ *\n\nWe have done braids like this on our girls for years, and they cutely call them \"Loony Braids\".  This braid is not anything new.  There is a 3-strand (like this one) and a 4-strand version.  This is a perfect \"Back-to-School\" look because it can be used on teens as well without looking like you belong on a series like \"Little House on the Prairie\".  You may add accessories as you deem necessary. \n\nFeel free to tag your own photos of this hairstyle with: #CGHLoonyBraids\n\nEnjoy!","date":"2010-08-23T02:56:17.000Z"}]}